Revit 2027 API
ViewDisplaySketchyLines Properties
The ViewDisplaySketchyLines type exposes the following members.
Properties
Name | Description
EnableSketchyLines |  True to enable sketchy lines visibility. False to disable it.
Extension |  The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Jitter |  The jitter defines jitteriness of the line. Values between 0 and 10.
Top
See Also
Reference
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace